<a href="https://colab.research.google.com/github/alishermutalov/pandas-lessons/blob/pandas-learning/Series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [5]:
obj = Series([4,7,-5,3.1])

In [6]:
obj

0    4.0
1    7.0
2   -5.0
3    3.1
dtype: float64

In [7]:
obj.values

array([ 4. ,  7. , -5. ,  3.1])

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj[0]

4.0

In [10]:
obj2 = Series([4,7,-5,3.1], index=['d','b','a','c'])

In [11]:
obj2

d    4.0
b    7.0
a   -5.0
c    3.1
dtype: float64

In [12]:
obj2['a']

-5.0

In [13]:
obj2[['a','b']]

a   -5.0
b    7.0
dtype: float64

In [14]:
obj2[obj2>2]

d    4.0
b    7.0
c    3.1
dtype: float64

In [15]:
obj2*2

d     8.0
b    14.0
a   -10.0
c     6.2
dtype: float64

In [16]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      22.197951
dtype: float64

In [17]:
cars_dict = {'Malibu':30000, 'Lacetti':14000}

In [18]:
new_series = Series(cars_dict)
new_series

Malibu     30000
Lacetti    14000
dtype: int64